#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>


int main()
{
	int a = 8;
	//0 0000_0000 0000 0000 0000 0000 000 1000
	float *pFloat = (float*)&a;//强制将int类型转换为float（单精度浮点型）类型
	printf("a的值: %d\n", a);//以整型放置a，以%d取出a的大小不变
	printf("*pFloat的值: %f\n", *pFloat);//以folat取出a
	//(-1)^0 * 0.0000 0000 0000 0000 000 1000 * 2^(1-127  -> 规定所存数值M的二进制位全为0时，E=1-127)

	//(-1)^S * M * 2^E --> （-1）^S表示符号位，S -> 0时正数，1时负数；M表示有效数字(1<=M<2)；2^E -> 指数位
	//E为无符号整数，IEEE中规定，科学计数法存在负数，所以E在存入内存时，真实值必须加上一个中间数，对于8byte
	//应加上中间数127，对于11byte时应加上中间数1023
	*pFloat = 8.0;
	//以*pFloat存数值
	//1000.0
	//(-1)^(0) * 1.000 * 2^3
	//0 10000010(存127+3) 000(小数部分) 0000 0000 0000 0000 0000
	//0 10000010 000 0000 0000 0000 0000 0000
	printf("a的值为: %d\n", a);
	//以%d取数值
	//
	printf("*pFloat的值为: %f\n", *pFloat);//以float存取数据时，数值不变
	return 0;
}



//int main()
//{
//	char a[1000];
//	int i ;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));//strlen求字符串长度时，寻找\0
//
//	return 0;
//}


//int main()
//{
//	char a = -128;//有符号char数表示范围为 -128~127；无符号char表示0~255
//	//1000_0000_0000_0000_0000_0000_1000_0000
//    //1111_1111_1111_1111_1111_1111_0111_1111
//	//1111_1111_1111_1111_1111_1111_1000_0000
//
//	//1000_0000（char中放置8bite）
//	
//	printf("%u\n", a);//%u -> 打印无符号整型数
//	//1111_1111_1111_1111_1111_1111_1000_0000
//	return 0;
//}

//int main()
//{
//	char a = -1;//由于打印的数值类型为%d（整型），所以会产生整型提升
//	//char中只存储8bite的补码（1111_1111），整型提升按照原符号位补齐(1111_1111_1111_1111_1111_1111_1111_1111)
//	//printf打印时为原码（1000_0000_0000_0000_0000_0000_0000_0001）-> -1
//	signed char b = -1;
//
//	unsigned char c = -1;
//	//无符号数(0000_0000_0000_0000_0000_0000_1111_1111)
//	//1111_1111  ->  255
//	printf("a=%d b=%d c=%d ", a, b, c);
//	return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//	//char* p = (char*)&a;
//	//返回1：小端
//	//返回0：大端
//		//return *p;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 1;//低地址位放置低数值
//	float b = 1.0;//数据类型影响，其存储的空间
//
//	return 0;
//}